---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.AllSlotsOnPanelOccupied
source: html/89aa230b-4890-0506-21f5-6d4d59e0e9f8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.AllSlotsOnPanelOccupied Property

All slots on panel: [Panel Name] are occupied. Some circuits will be disconnected from this panel.

## Syntax (C#)
```csharp
public static FailureDefinitionId AllSlotsOnPanelOccupied { get; }
```